#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "rus");





	int arr[3][3][3] = {
		{
			{-111,  112,  113},
			{ 121, -122,  123},
			{ 131,  132, -133}
		},
		{
			{-211,  212,  213},
			{ 221,  222, -223},
			{ 231, -232,  233}
		},
		{
			{ 311, -312, -313},
			{-321,  322,  323},
			{ 331,  332,  333}
		}
	};
	int kol = 0;

	cout << "\t 8 задание\n"
		<< "Все отрицательные элементы массива и их адреса: \n";
	
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			for (int k = 0; k < 3; k++) {
				if (arr[i][j][k] < 0) {
					cout << arr[i][j][k] << "\t" << &arr[i][j][k] << endl;
					kol++;
				}
			}
		}
	}
	cout << "\nКол-во отрицательных элементов: " << kol << endl;
}